{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-brand_name",
    "1": "B-dosage_form",
    "2": "B-dosage_pack",
    "3": "B-dosage_strength",
    "4": "B-flavor",
    "5": "B-generic_name",
    "6": "B-total_individual_units",
    "7": "B-volume",
    "8": "I-brand_name",
    "9": "I-dosage_form",
    "10": "I-dosage_pack",
    "11": "I-dosage_strength",
    "12": "I-flavor",
    "13": "I-generic_name",
    "14": "I-total_individual_units",
    "15": "I-volume",
    "16": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-brand_name": 0,
    "B-dosage_form": 1,
    "B-dosage_pack": 2,
    "B-dosage_strength": 3,
    "B-flavor": 4,
    "B-generic_name": 5,
    "B-total_individual_units": 6,
    "B-volume": 7,
    "I-brand_name": 8,
    "I-dosage_form": 9,
    "I-dosage_pack": 10,
    "I-dosage_strength": 11,
    "I-flavor": 12,
    "I-generic_name": 13,
    "I-total_individual_units": 14,
    "I-volume": 15,
    "O": 16
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.53.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
